In [1]:
import pandas as pd
import numpy as np
import scipy as sp
import seaborn as sns
import scipy.stats as st
import matplotlib.pyplot as plt
import time
import statsmodels.api as sm
client=pd.read_csv("Data/customers.csv")
produit=pd.read_csv("Data/products.csv")
transaction=pd.read_csv("Data/transactions.csv")

# Nettoyage de Produit

In [4]:
produit.head(n=3)

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0

In [5]:
produit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3287 entries, 0 to 3286
Data columns (total 3 columns):
id_prod    3287 non-null object
price      3287 non-null float64
categ      3287 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 77.1+ KB

In [6]:
produit=pd.read_csv("products.csv",dtype={'categ':'category'})

In [7]:
produit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3287 entries, 0 to 3286
Data columns (total 3 columns):
id_prod    3287 non-null object
price      3287 non-null float64
categ      3287 non-null category
dtypes: category(1), float64(1), object(1)
memory usage: 54.7+ KB

In [8]:
produit.describe() #Ici on observe qu'il y a un price négatif chose impossible

             price
count  3287.000000
mean     21.856641
std      29.847908
min      -1.000000
25%       6.990000
50%      13.060000
75%      22.990000
max     300.000000

In [9]:
print(produit.loc[produit['price']<0,:])#On va identifier ce prix négatif rapidement

    id_prod  price categ
731     T_0   -1.0     0

In [10]:
produit= produit[~produit['id_prod'].str.startswith('T_')]#on s'apercois que l'id commence par 'T_'chose 
#inhabituelle ds la structure de l'id, donc on va le retirer 
produit.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3286 entries, 0 to 3286
Data columns (total 3 columns):
id_prod    3286 non-null object
price      3286 non-null float64
categ      3286 non-null category
dtypes: category(1), float64(1), object(1)
memory usage: 80.2+ KB

 # Nettoyage de de transaction

In [11]:
transaction.head(n=3)

  id_prod                        date session_id client_id
0  0_1483  2021-04-10 18:37:28.723910    s_18746    c_4450
1   2_226  2022-02-03 01:55:53.276402   s_159142     c_277
2   1_374  2021-09-23 15:13:46.938559    s_94290    c_4270

In [12]:
transaction= transaction[~transaction['id_prod'].str.startswith('T_')]#On nettoie du coup partout cet id

In [13]:
transaction.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 336816 entries, 0 to 337015
Data columns (total 4 columns):
id_prod       336816 non-null object
date          336816 non-null object
session_id    336816 non-null object
client_id     336816 non-null object
dtypes: object(4)
memory usage: 12.8+ MB

# Nettoyage de client

In [14]:
client.head(n=3)

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984

In [15]:
client.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
client_id    8623 non-null object
sex          8623 non-null object
birth        8623 non-null int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

In [16]:
client=pd.read_csv("Data/customers.csv",dtype={'sex':'category'})
#Le but est de transformer la variable sexe en catégorie

In [17]:
client=client[~client['client_id'].str.startswith('ct_')]#ici on identifie le 'ct_' qui est l'équivalent du 'T_'
client.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8621 entries, 0 to 8622
Data columns (total 3 columns):
client_id    8621 non-null object
sex          8621 non-null category
birth        8621 non-null int64
dtypes: category(1), int64(1), object(1)
memory usage: 210.5+ KB

In [18]:
print((client['client_id']=="ct_0").value_counts())

False    8621
Name: client_id, dtype: int64

# FUSION DES DATASETS

In [19]:
Merge1=transaction.merge(produit, left_on='id_prod', right_on='id_prod', how='left')
#On réalise un merge à gauche pour verifier qu'on ne perd pas des produits avec un inner

In [20]:
Merge1.head(n=4)

  id_prod                        date session_id client_id  price categ
0  0_1483  2021-04-10 18:37:28.723910    s_18746    c_4450   4.99     0
1   2_226  2022-02-03 01:55:53.276402   s_159142     c_277  65.75     2
2   1_374  2021-09-23 15:13:46.938559    s_94290    c_4270  10.71     1
3  0_2186  2021-10-17 03:27:18.783634   s_105936    c_4597   4.20     0

In [21]:
sell=Merge1.merge(client,left_on='client_id',right_on='client_id',how='left') #On continue pour tout fusionner

In [22]:
sell.head()

,id_prod,date,session_id,client_id,price,categ,sex,birth
0,0_1483,2021-04-10 18:37:28.723910,s_18746,c_4450,4.99,0,f,1977
1,2_226,2022-02-03 01:55:53.276402,s_159142,c_277,65.75,2,f,2000
2,1_374,2021-09-23 15:13:46.938559,s_94290,c_4270,10.71,1,f,1979
3,0_2186,2021-10-17 03:27:18.783634,s_105936,c_4597,4.20,0,m,1963
4,0_1351,2021-07-17 20:34:25.800563,s_63642,c_1242,8.99,0,f,1980

In [23]:
sell.head(n=4)

,id_prod,date,session_id,client_id,price,categ,sex,birth
0,0_1483,2021-04-10 18:37:28.723910,s_18746,c_4450,4.99,0,f,1977
1,2_226,2022-02-03 01:55:53.276402,s_159142,c_277,65.75,2,f,2000
2,1_374,2021-09-23 15:13:46.938559,s_94290,c_4270,10.71,1,f,1979
3,0_2186,2021-10-17 03:27:18.783634,s_105936,c_4597,4.20,0,m,1963

In [24]:
sell.date=pd.to_datetime(sell.date) #On transforme notre colonne date en type date

In [25]:
sell.head(n=4)

,id_prod,date,session_id,client_id,price,categ,sex,birth
0,0_1483,2021-04-10 18:37:28.723910,s_18746,c_4450,4.99,0,f,1977
1,2_226,2022-02-03 01:55:53.276402,s_159142,c_277,65.75,2,f,2000
2,1_374,2021-09-23 15:13:46.938559,s_94290,c_4270,10.71,1,f,1979
3,0_2186,2021-10-17 03:27:18.783634,s_105936,c_4597,4.20,0,m,1963

In [26]:
sell.date[1]#On vérifie juste la modification

Timestamp('2022-02-03 01:55:53.276402')

In [27]:
sell.info()
#Ici on affiche notre jeu de données pour verifer le nombre non null et observer des inconhérences

<class 'pandas.core.frame.DataFrame'>
Int64Index: 336816 entries, 0 to 336815
Data columns (total 8 columns):
id_prod       336816 non-null object
date          336816 non-null datetime64[ns]
session_id    336816 non-null object
client_id     336816 non-null object
price         336713 non-null float64
categ         336713 non-null category
sex           336816 non-null category
birth         336816 non-null int64
dtypes: category(2), datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 28.6+ MB

In [28]:
print(sell.loc[sell['price'].isnull(),:])
#On vient d'identifier dans price 103 valeurs qui sont nulles

       id_prod                       date session_id client_id  price categ  \
6231    0_2245 2021-06-17 03:03:12.668129    s_49705    c_1533    NaN   NaN
10797   0_2245 2021-06-16 05:53:01.627491    s_49323    c_7954    NaN   NaN
14045   0_2245 2021-11-24 17:35:59.911427   s_124474    c_5120    NaN   NaN
17480   0_2245 2022-02-28 18:08:49.875709   s_172304    c_4964    NaN   NaN
21071   0_2245 2021-03-01 00:09:29.301897        s_3     c_580    NaN   NaN
21754   0_2245 2022-02-11 09:05:43.952857   s_163405    c_1098    NaN   NaN
22672   0_2245 2021-10-19 00:28:01.920054   s_106841    c_3953    NaN   NaN
24576   0_2245 2022-02-25 00:08:08.736068   s_170426    c_6236    NaN   NaN
30874   0_2245 2021-08-22 08:51:27.564509    s_79102    c_6752    NaN   NaN
31330   0_2245 2021-05-12 03:36:34.586221    s_33316    c_6205    NaN   NaN
34893   0_2245 2021-10-15 09:31:31.539354   s_105069    c_4188    NaN   NaN
35568   0_2245 2021-12-29 23:24:51.621799   s_142078    c_2189    NaN   NaN
37123   0_2245 2022-02-24 04:18:45.054650   s_169978    c_5953    NaN   NaN
37849   0_2245 2021-03-29 04:29:29.995701    s_12938    c_1025    NaN   NaN
41202   0_2245 2022-01-04 19:02:47.712837   s_144966    c_8595    NaN   NaN
42031   0_2245 2021-09-19 03:08:45.918021    s_92049    c_4935    NaN   NaN
44636   0_2245 2021-10-04 21:20:27.540982   s_100047    c_8138    NaN   NaN
48892   0_2245 2021-09-23 07:22:38.636773    s_94139    c_4746    NaN   NaN
50759   0_2245 2021-11-21 18:39:25.649231   s_123006    c_6268    NaN   NaN
52028   0_2245 2021-04-17 16:43:16.543156    s_21906    c_7808    NaN   NaN
53064   0_2245 2021-06-05 17:04:43.982913    s_44481    c_6714    NaN   NaN
53623   0_2245 2021-09-11 10:52:05.205583    s_88251    c_3468    NaN   NaN
57432   0_2245 2021-09-01 23:54:58.803916    s_83778    c_2504    NaN   NaN
59781   0_2245 2021-08-14 23:34:15.559623    s_75819    c_5157    NaN   NaN
60536   0_2245 2021-05-11 03:28:02.080884    s_32846    c_2028    NaN   NaN
69464   0_2245 2021-05-06 20:14:22.522372    s_30824    c_4973    NaN   NaN
75864   0_2245 2021-09-03 04:31:18.063440    s_84343    c_5056    NaN   NaN
86129   0_2245 2021-08-06 01:51:40.749182    s_71925    c_2039    NaN   NaN
87935   0_2245 2021-09-26 17:52:55.561657    s_95930    c_6990    NaN   NaN
88566   0_2245 2022-01-09 09:23:31.000720   s_147220    c_4505    NaN   NaN
...        ...                        ...        ...       ...    ...   ...
239835  0_2245 2021-09-07 20:55:19.719028    s_86505    c_8153    NaN   NaN
241379  0_2245 2021-09-10 08:04:02.763762    s_87678    c_4120    NaN   NaN
242146  0_2245 2021-08-23 09:24:14.133889    s_79561    c_6713    NaN   NaN
247283  0_2245 2021-04-22 04:57:20.090378    s_23987    c_6714    NaN   NaN
251130  0_2245 2022-01-15 06:19:44.035000   s_150064    c_4765    NaN   NaN
253072  0_2245 2021-04-10 02:26:04.604882    s_18428    c_1876    NaN   NaN
253935  0_2245 2021-05-22 09:28:34.806734    s_37909    c_1811    NaN   NaN
257769  0_2245 2021-11-12 09:25:22.905886   s_118458    c_7416    NaN   NaN
260108  0_2245 2021-04-10 08:59:14.100780    s_18560    c_3454    NaN   NaN
267538  0_2245 2022-02-16 11:35:20.319501   s_166050    c_4453    NaN   NaN
273136  0_2245 2021-07-03 03:26:35.696673    s_57134    c_5108    NaN   NaN
276855  0_2245 2021-03-28 10:46:04.804784    s_12567     c_966    NaN   NaN
278534  0_2245 2021-11-11 04:36:55.259042   s_117850    c_4333    NaN   NaN
282364  0_2245 2021-11-01 14:00:26.535213   s_113219    c_7810    NaN   NaN
283345  0_2245 2021-11-30 21:49:23.614810   s_127497    c_4721    NaN   NaN
297045  0_2245 2022-02-20 03:50:42.646180   s_167926    c_7287    NaN   NaN
298155  0_2245 2021-04-02 14:31:03.612048    s_14980    c_7849    NaN   NaN
298370  0_2245 2021-10-26 03:31:42.296144   s_110231    c_8286    NaN   NaN
300724  0_2245 2021-09-06 14:03:40.171938    s_85877    c_1060    NaN   NaN
305421  0_2245 2021-03-28 21:39:14.337424    s_12792    c_2688    NaN   NaN
311466  0_2245 2021-12-10 21:36:59.873580   s_132462    c_2266    NaN   NaN
312452  0_2245 2021-07-10 11:54:44.891532    s_60426    c_6952    NaN   NaN
312857  0_2245 2021-08-19 12:22:41.380319    s_77853    c_2613    NaN   NaN
316110  0_2245 2022-02-07 09:39:59.546556   s_161318     c_554    NaN   NaN
320466  0_2245 2021-11-20 20:21:06.505658   s_122593    c_8524    NaN   NaN
322523  0_2245 2021-04-06 19:59:19.462288    s_16936    c_4167    NaN   NaN
329226  0_2245 2021-03-30 23:29:02.347672    s_13738    c_7790    NaN   NaN
330297  0_2245 2021-12-03 14:14:40.444177   s_128815    c_6189    NaN   NaN
335331  0_2245 2021-04-27 18:58:47.703374    s_26624    c_1595    NaN   NaN
336020  0_2245 2021-05-01 03:35:03.146305    s_28235    c_5714    NaN   NaN

       sex  birth
6231     m   1972
10797    m   1973
14045    f   1975
17480    f   1982
21071    m   1988
21754    m   1986
22672    f   1984
24576    f   1976
30874    m   1987
31330    f   1984
34893    f   1935
35568    f   1983
37123    m   1986
37849    m   1984
41202    f   1980
42031    f   1982
44636    f   1984
48892    m   1940
50759    m   1991
52028    m   1977
53064    f   1968
53623    f   1981
57432    m   1976
59781    f   1979
60536    f   1978
69464    f   1983
75864    f   1991
86129    f   1982
87935    f   1986
88566    m   1976
...     ..    ...
239835   f   1975
241379   f   1979
242146   f   1963
247283   f   1968
251130   m   1982
253072   m   1983
253935   f   1991
257769   m   1933
260108   m   1969
267538   m   1981
273136   m   1978
276855   f   1981
278534   m   1956
282364   m   1978
283345   f   1988
297045   f   1978
298155   f   1978
298370   f   1980
300724   f   1973
305421   f   1968
311466   f   1987
312452   f   1977
312857   m   1975
316110   m   1979
320466   f   1982
322523   f   1979
329226   f   1983
330297   f   1984
335331   f   1973
336020   f   1972

[103 rows x 8 columns]

In [29]:
sell.loc[sell.isnull().any(axis=1)].shape

(103, 8)

A partir de la nous avons quatre choix pour traitrer nos NAN : 
1)Supprimer les lignes : si les NAN<5% du jeu de données 
2)Inputation par valeur fixe (on remplace en effectuant : moyenne, median etc...)
3)Inputation par méthode de prédiction, remplacer par ce qui aurait pu être 
4)Si les nb de NAN sont trop importants, et si les autres solutions ne marchent pas alors on les supprimer

Ici on aurait pu opter pour la première solution, en les supprimant, néanmoins mon tuteur m'a demandé de faire la faire la méthode numéro 2.

In [30]:
sell.head(n=30)

,id_prod,date,session_id,client_id,price,categ,sex,birth
0,0_1483,2021-04-10 18:37:28.723910,s_18746,c_4450,4.99,0,f,1977
1,2_226,2022-02-03 01:55:53.276402,s_159142,c_277,65.75,2,f,2000
2,1_374,2021-09-23 15:13:46.938559,s_94290,c_4270,10.71,1,f,1979
3,0_2186,2021-10-17 03:27:18.783634,s_105936,c_4597,4.20,0,m,1963
4,0_1351,2021-07-17 20:34:25.800563,s_63642,c_1242,8.99,0,f,1980
5,0_1085,2021-09-15 05:47:48.215162,s_90139,c_2526,3.99,0,f,1982
6,0_1508,2021-08-29 05:39:01.055455,s_82100,c_5799,8.03,0,f,1962
7,0_1627,2021-09-19 14:54:52.410362,s_92294,c_1422,3.99,0,f,1980
8,0_1469,2022-02-03 07:13:22.559995,s_159252,c_2207,14.99,0,f,1970
9,0_1453,2022-02-26 09:03:10.571665,s_171098,c_5433,7.99,0,f,1981
10,0_423,2021-10-09 23:50:33.907269,s_102501,c_2225,1.99,0,f,1949
11,0_1613,2021-06-11 18:01:45.863768,s_47281,c_220,8.99,0,m,1960
12,0_1368,2021-10-02 10:50:43.188179,s_98886,c_857,5.13,0,m,1985
13,0_1442,2021-04-24 20:15:14.093786,s_25237,c_2828,4.89,0,f,1987
14,0_1207,2021-10-12 23:22:51.290635,s_103927,c_648,16.99,0,m,1976
15,1_281,2022-02-10 09:56:32.868016,s_162888,c_7099,23.99,1,f,1971
16,1_285,2021-11-15 11:32:23.000489,s_119978,c_611,14.99,1,f,1987
17,0_1452,2021-10-15 10:07:12.401758,s_105078,c_6297,13.77,0,f,1969
18,0_1147,2022-01-17 06:11:13.607620,s_150997,c_3679,6.99,0,f,1989
19,0_1489,2022-01-20 02:28:53.972711,s_152391,c_2434,10.99,0,f,1988
20,1_333,2021-12-17 06:22:03.132127,s_135611,c_615,15.99,1,m,1970
21,0_336,2021-07-10 04:48:50.708782,s_60294,c_3561,3.23,0,m,1991
22,0_2304,2021-11-02 23:57:37.632657,s_113918,c_6152,15.86,0,f,1952
23,1_644,2021-05-29 06:55:31.348787,s_41069,c_6781,25.79,1,m,1966
24,1_274,2022-02-09 04:57:29.344848,s_162284,c_4306,24.40,1,m,1964
25,0_2033,2021-12-26 03:05:52.819661,s_140117,c_1407,14.99,0,f,1956
26,0_1315,2021-03-16 22:10:32.911766,s_7307,c_914,10.99,0,f,1988
27,2_135,2021-05-26 01:46:59.530702,s_39581,c_5192,68.99,2,m,1965
28,0_1572,2021-10-18 10:44:56.742021,s_106579,c_8589,8.61,0,m,1958
29,1_333,2021-08-09 20:27:58.329230,s_73560,c_6706,15.99,1,f,1945

In [31]:
moyenne_cat0=sell.loc[sell['categ']=='0','price'].mean()
#Ici on s'aperçoit que le début de l'id production correspond en général à sa categorie de produit. 
#Ici on n'observe alors que nous avons que des produits de catégorie 0
#Ici nous faisons tout simplement la moyenne des produits de catégorie pour remplacer ensuite sur les NAN

In [32]:
sell.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 336816 entries, 0 to 336815
Data columns (total 8 columns):
id_prod       336816 non-null object
date          336816 non-null datetime64[ns]
session_id    336816 non-null object
client_id     336816 non-null object
price         336713 non-null float64
categ         336713 non-null category
sex           336816 non-null category
birth         336816 non-null int64
dtypes: category(2), datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 28.6+ MB

In [33]:
print(moyenne_cat0)

10.646828235274288

In [34]:
sell.loc[sell['price'].isnull(), 'price'] = 10.646828235274288
sell.loc[sell['categ'].isnull(), 'categ']='0'
#Nous avons donc calculé la moyenne d'un produit de catégorie 0 et nous remplacons 
#Et comme nous savons que se sont des produits de categorie 0, on va l'écrire

In [35]:
sell['age']=2022-sell['birth']
#Ici nous sommes intéressé pour connaître l'age de nos clients pour les missions à venir

In [36]:
sell.head(n=3)

,id_prod,date,session_id,client_id,price,categ,sex,birth,age
0,0_1483,2021-04-10 18:37:28.723910,s_18746,c_4450,4.99,0,f,1977,45
1,2_226,2022-02-03 01:55:53.276402,s_159142,c_277,65.75,2,f,2000,22
2,1_374,2021-09-23 15:13:46.938559,s_94290,c_4270,10.71,1,f,1979,43

In [37]:
sell.to_csv("Data/sell.csv")